In [151]:
import pandas as pd

In [152]:
df = pd.read_csv('orders_sample.csv') 
#сделали id таблицы - индексом
df.head()

   id  user_id  order_sum  order_date
0   3       12      38.29  2018-06-03
1  12      159     406.86  2018-06-13
2  18      173     149.22  2018-06-15
3  16      173     206.32  2018-06-15

In [153]:
df.index #напишет что является индексом сейчас
# df.index = df['id'] #назначаем что будет индексом в таблц

RangeIndex(start=0, stop=4, step=1)

In [154]:
# df = df.set_index('id')
# df = df.reset_index()
# df

In [155]:
#получение колонок


df[['user_id', 'order_sum']] #передаём список элементов 

cols = ['user_id', 'order_sum'] #альтернативный вариант
df[cols]

df[['user_id', 'order_sum']] #возвращает pandas.DataFrame
# т.е. новую таблицу
# используем если дальше работаем с функциями DataFrame

   user_id  order_sum
0       12      38.29
1      159     406.86
2      173     149.22
3      173     206.32

In [156]:
df['order_sum'] #возвращает список в виде pandas.Series
# т.е. значение одного столбица
# используем если дальше будем фильтровать, вычислять, 
# или строить графики

0     38.29
1    406.86
2    149.22
3    206.32
Name: order_sum, dtype: float64

In [157]:
#получение строк / location 
df.loc[[3]] # получаем дата фрейм из строк по индексу

df.loc[1:3] # получаем серию по индексу в диапазоне 

dd = df.loc[[2,3]] #собрали нужные строки
dd[['user_id', 'order_sum']] #вывели только нужные колонки

df.loc[[1,3], ['user_id', 'order_sum']] 
# первый элемент - выбирает строки
# второй эл - выбирает колонки → получаем дата фрейм

   user_id  order_sum
1      159     406.86
3      173     206.32

In [158]:
# получение строк

In [159]:
# получение ячеек
df.loc[1,'user_id'] #может возвращать срезы

np.int64(159)

In [160]:
# получение ячеек
df.at[1,'user_id'] #возвращает значение ячейки

np.int64(159)

In [161]:
# получение ячеек
df.loc[1]
df.iloc[0] # всегда возвращает нужную строку независимо от индекса

id                     3
user_id               12
order_sum          38.29
order_date    2018-06-03
Name: 0, dtype: object

In [ ]:
# фильтры
# каждая колонка дата фрейма - это серия

df['order_sum'] > 100 # применили к колонке order_sum
                      # поэлементно операцию > 100
                      # получили серию true, false
df.loc[df['order_sum'] > 100] # передали эту серию в датафрейм

(df['order_sum'] > 100) # получаем булеан значения
(df['user_id'] == 173)  # получаем ещё булеан значения
                        # и соединяем через &

df.loc[
    (df['order_sum'] > 100) &
    (df['user_id'] == 173)
      ] #сочетаем два условия через () и &

   id  user_id  order_sum  order_date
2  18      173     149.22  2018-06-15
3  16      173     206.32  2018-06-15

In [178]:
df[
    (df['order_sum'] > 100) &
    (df['user_id'] == 173)
      ]

   id  user_id  order_sum  order_date
2  18      173     149.22  2018-06-15
3  16      173     206.32  2018-06-15